Revit 2027 API
BuiltInFailures.RebarFailures.CantMakeFillets Property
 The bar cannot be bent in that shape. Check the bending diameter and the bar type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CantMakeFillets { get; }
Public Shared ReadOnly Property CantMakeFillets As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CantMakeFillets {
	FailureDefinitionId^ get ();
}
static member CantMakeFillets : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RebarFailures Class
Autodesk.Revit.DB Namespace